performance/raquetelio/warm-up-artilleryRaceRegistration.yml
config:
  target: "http://192.168.49.2:31860"
  phases:
    - duration: 30
      arrivalRate: 1    
      maxVusers: 30  
      name: Warm up

    - duration: 60
      arrivalRate: 800
      maxVusers: 60000
      name: Massive load
  http:
    timeout: 80

scenarios:
  - name: "Get open races"
    flow:
      - get:
          url: "/api/races?open=true"